#+TITLE: Scheduling in GO
#+DATE: 2020-08-09

#+EXPORT_FILE_NAME: scheduling-in-go
#+HUGO_WEIGHT: auto
#+HUGO_BASE_DIR: ~/G/blog
#+HUGO_AUTO_SET_LASTMOD: t
#+HUGO_SECTION: notes
#+HUGO_CATEGORIES: notes
#+HUGO_TAGS: golang goroutine schedule os thread


#+begin_quote
It’s important to have a general and representative understanding of how both
the OS and Go schedulers work to design your multithreaded software correctly.

/- by The Author: [[https://github.com/ardan-bkennedy][ardan-bkennedy (William Kennedy) · GitHub]]/
#+end_quote

#+begin_quote
Original Posts:
- [[https://www.ardanlabs.com/blog/2018/08/scheduling-in-go-part1.html][Scheduling In Go : Part I - OS Scheduler]]
- [[https://www.ardanlabs.com/blog/2018/08/scheduling-in-go-part2.html][Scheduling In Go : Part II - Go Scheduler]]
- [[https://www.ardanlabs.com/blog/2018/12/scheduling-in-go-part3.html][Scheduling In Go : Part III - Concurrency]]
#+end_quote


** Executing Instructions
#+BEGIN_SRC go :exports both :imports "fmt"
func main() {
	fmt.Println("panic")
	example(make([]string, 2, 4), "hello", 10)
}

func example(slice []string, str string, i int) {
	panic("Want stack trace")
}
#+END_SRC

#+RESULTS:
#+BEGIN_EXAMPLE
panic: Want stack trace

goroutine 1 [running]:
main.example(...)
	/Users/eric/G/w/golangtour/doc/examples/schedulingingo/ExecutingiInstructions/example.go:8
main.main()
	/Users/eric/G/w/golangtour/doc/examples/schedulingingo/ExecutingiInstructions/example.go:4 +0x39
exit status 2
#+END_EXAMPLE

- Listing3

#+BEGIN_EXAMPLE
$ go tool objdump -S -s "main.example" ./example1
TEXT main.example(SB) stack_trace/example1/example1.go
func example(slice []string, str string, i int) {
  0x104dfa0		65488b0c2530000000	MOVQ GS:0x30, CX
  0x104dfa9		483b6110		CMPQ 0x10(CX), SP
  0x104dfad		762c			JBE 0x104dfdb
  0x104dfaf		4883ec18		SUBQ $0x18, SP
  0x104dfb3		48896c2410		MOVQ BP, 0x10(SP)
  0x104dfb8		488d6c2410		LEAQ 0x10(SP), BP
	panic("Want stack trace")
  0x104dfbd		488d059ca20000	LEAQ runtime.types+41504(SB), AX
  0x104dfc4		48890424		MOVQ AX, 0(SP)
  0x104dfc8		488d05a1870200	LEAQ main.statictmp_0(SB), AX
  0x104dfcf		4889442408		MOVQ AX, 0x8(SP)
  0x104dfd4		e8c735fdff		CALL runtime.gopanic(SB)
  0x104dfd9		0f0b			UD2              <--- LOOK HERE PC(+0x39)
#+END_EXAMPLE

#+begin_quote
The hex number ~+0x39~ represents the PC offset for an instruction inside the
example...

Remember: the PC is the next instruction, not the current one. Listing 3 is a
good example of the amd64 based instructions that the Thread for this Go program
is in charge of executing sequentially. #+end_quote

*** Logical Processor (P)

- Virtual cores: *P*

#+begin_quote
When your Go program starts up, it’s given a Logical Processor (P) for every
/virtual core/ that is identified on the host machine.

For Hyper-Threading CPU, each hardware thread will be presented to your Go
program as a virtual core.
#+end_quote

#+BEGIN_SRC go :exports both :imports "fmt"
package main

import "runtime"

func main() {
    // NumCPU returns the number of logical
    // CPUs usable by the current process.
	  // 四核八线程
    fmt.Println(runtime.NumCPU())
}
#+END_SRC

#+RESULTS:
: 8

*** Sequencial Add

#+BEGIN_SRC go :exports both :imports "fmt"
func add(nums []int) int {
	var ret int
	for _, n := range nums {
		ret += n
	}
	return ret
}

func main() {
    nums := []int{1, 2, 3}
	fmt.Println(add(nums))
}
#+END_SRC

#+RESULTS:
: 6
